# ЗАДАНИЕ: Скобочная последовательность

# Марсоход отправляет на Землю структурированные данные;
# в структурах применяются скобки трёх разных видов: [], () и {}.
# Скобки могут быть вложены друг в друга сколько угодно раз.

# Всё бы хорошо, но во время жаркого марсианского лета марсоход перегрелся
# и по неизвестной причине начал путать скобки.
# Это привело к тому, что открытые скобки остаются незакрытыми и закрывающие скобки не имеют открывающих.
# Прочесть такую структуру становится невозможно.

# В Центре управления марсоходами решили создать программу для контроля за расстановкой скобок.
# Если в сообщении порядок скобок нарушен, марсоход создаст сообщение заново:
# в этом случае вероятность повторения ошибок минимальна.

# Напишите функцию is_correct_bracket_seq(), которая принимает на вход скобочную последовательность и возвращает True,
# если последовательность правильная, и False — в остальных случаях.

# ЧТО СЧИТАТЬ ПРАВИЛЬНОЙ ПОСЛЕДОВАТЕЛЬНОСТЬЮ
# - Пустая строка — это правильная скобочная последовательность.
# - Правильная скобочная последовательность, взятая в скобки одного типа, — тоже правильная: ( { [ ] } ).
# - Правильная скобочная последовательность с приписанной
# слева или справа правильной скобочной последовательностью — правильная: ( { [ ] } ) ( [ ] ).

# Формат ввода
# На вход подаётся одна строка, содержащая скобочную последовательность. Скобки записаны подряд, без пробелов.


# Формат вывода
# True или False.



# Пример 1.
# Ввод:
# {[()]}

# Вывод:
# True



# # Пример 2.
# Ввод:
# )(

# Вывод:
# False



# # Пример 3.
# Ввод:
# (((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((()))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))){}

# Вывод:
# True



# # Пример 4.
# Ввод:
# ({})({[]}[])

# Вывод:
# True








# РЕШЕНИЕ
def is_correct_bracket_seq(bracket_seq):
    """Функция проверки скобок"""
    stack = []

    for item in bracket_seq:
        if item == '(' or item == '{' or item == '[':
            stack.append(item)
            continue
        if stack != []:
            last_item = stack.pop()
            if last_item + item == '()' \
                    or last_item + item == '[]' \
                    or last_item + item == '{}':
                continue
            else:
                return False
        else:
            return False
    if stack == []:
        return True
    else:
        return False


def main():
    """Основная функция"""
    bracket_seq = list(input())
    print(is_correct_bracket_seq(bracket_seq))


if __name__ == "__main__":
    main()
