bremen_musicians = ['Кот', 'Пёс', 'Трубадур', 'Осёл', 'Петух']

for musician in bremen_musicians:
    # Каждый элемент списка bremen_musicians 
    # по очереди будет передан в переменную musician
    # и напечатан
    print(musician)

# Здесь может быть какой-то код, который выполнится
# только после того, как цикл закончит работу




pigs = ['Ниф-Ниф', 'Наф-Наф', 'Нуф-Нуф']

print('Дорогие свиньи!')

for pig in pigs:
    print(pig)

print('приглашаю вас на ужин!')
print('Любящий вас Волк.')






# ОТСТУПЫ ВАЖНЫ

numbers = ['Раз', 'Два', 'Три', 'Четыре', 'Пять']
for number in numbers:
    print(number)
    print('Вышел зайчик погулять')









# Задача дописать код, чтобы получилась таблица умножения
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]

...
...
print(number_1, '*', number_2, '=', number_1 * number_2)
